Repository: KDE/kbruch
Catalog: po/*/kbruch.po
Languages: ar, eo, nl

# NAME OF TRANSLATORS
source: Your names
ar: أحمد محمد زواوي,زايد السعيدي
eo: Axel Rousseau,Oliver Kellogg
nl: Rinse de Vries,Jaap Woldringh,Freek de Kruijf

# EMAIL OF TRANSLATORS
source: Your emails
ar: azawawi@emirates.net.ae,zayed.alsaidi@gmail.com
eo: axel@esperanto-jeunes.org,olivermkellogg@gmail.com
nl: rinse@kde.nl,jjh.woldringh@planet.nl,freekdekruijf@kde.nl

source: KBruch modes:
ar: أنماط الكسور:
eo: KBruch-reĝimoj:
nl: Keuzes in KBruch:

# @info:tooltip
source: Open standard KBruch
ar: افتح الكسور العادي
eo: Malfermi norman KBruch

source: Exercise
ar: تدريب
eo: Ekzerco
nl: Oefening

# @info:tooltip
source: Open learning KBruch
ar: افتح الكسور التعليمي
eo: Malfermi lernadan KBruch

source: Learning
ar: تعلم
eo: Lernado
nl: Leren

source: &File
ar: &ملف
eo: &Dosiero
nl: &Bestand

# @info:tooltip
source: Click on this button to select the 'greater than' sign.
ar: انقر على هذا الزر لتحديد علامة "أكبر من".
eo: Alklaku ĉi tiun butonon por elekti la signon 'pli granda ol'.

# @info:tooltip
source: Click on this button to select the 'less than' sign.
ar: انقر على هذا الزر لتحديد علامة "أصغر من".
eo: Alklaku ĉi tiun butonon por elekti la signon 'malpli ol'.

# @info:tooltip
source: Click on this button to select the 'equals' sign.
ar: انقر على هذا الزر لتحديد علامة "يساوي".
eo: Alklaku ĉi tiun butonon por elekti la signon 'egalas'.

source: &Skip
ar: ت&خطّ
eo: La&si
nl: &Overslaan

# @info:tooltip
source: Click on this button to skip this question.
ar: انقر على هذا الزر لتخطي هذا السؤال
eo: Alklaku ĉi tiun butonon por preterlasi ĉi tiun demandon.

# @info:tooltip
source: In this exercise you have to compare two given fractions.
ar: في هذا التمرين عليك مقارنة كسرين محددين.
eo: En ĉi tiu ekzerco vi devas kompari du donitajn frakciojn.

source: In this exercise you have to compare two given fractions and choose the correct comparison sign.
ar: في هذا التمرين عليك مقارنة كسرين محددين واختيار علامة المقارنة الصحيحة.
eo: En ĉi tiu ekzerco vi devas kompari du donitajn frakciojn kaj elekti la ĝustan komparsignon.
nl: In deze opgave moet je twee gegeven breuken met elkaar vergelijken, en het goede vergelijkingsteken kiezen.

# @info:tooltip
source: Click on this button to check your result.
ar: انقر على هذا الزر للتحقق من النتيجة.
eo: Alklaku ĉi butonon por kontroli vian rezulton.

source: &Next
ar: ال&تالي
eo: &Sekva
nl: &Volgende

# @info:tooltip
source: Enter the numerator of your result
ar: أدخل بسط الكسر لنتيجتك
eo: Enigu la numeranton de via rezulto

# @info:tooltip
source: Enter the denominator of your result
ar: أدخل مقام الكسر لنتيجتك
eo: Enigu la nomanton de via rezulto

source: &Check
ar: تحقق
eo: &Kontroli
nl: Antwoord &controleren

# @info:tooltip
source: Click on this button to check your result. The button will not work if you have not entered a result yet.
ar: انقر على هذا الزر للتحقق من نتيجتك. لن يعمل الزر إذا لم تدخل النتيجة بعد.
eo: Alklaku ĉi tiun butonon por kontroli vian rezulton. La butono ne funkcios se vi ankoraŭ ne enigis rezulton.

# @info:tooltip
source: In this exercise you have to convert a number into a fraction.
ar: في هذا التمرين عليك تحويل الرقم إلى كسر.
eo: En ĉi tiu ekzerco vi devas konverti nombron en frakcion.

source: In this exercise you have to convert a given number into a fraction by entering a numerator and denominator. Do not forget to reduce the result.
ar: في هذا التمرين، عليك تحويل رقم معين إلى كسر عن طريق إدخال البسط والمقام. لا تنسَ تقليل النتيجة.
eo: En ĉi tiu ekzerco vi devas konverti donitan nombron en frakcion per enigo de numeratoro kaj denominatoro. Ne forgesu redukti la rezulton.
nl: In deze oefening moet je een gegeven getal omrekenen naar een breuk, waarvan je de teller en de noemer invult. Vergeet niet het antwoord te vereenvoudigen.

# @info:tooltip
source: Click on this button to get to the next question.
ar: انقر على هذا الزر للوصول إلى السؤال التالي.
eo: Alklaku ĉi tiun butonon por atingi la sekvan demandon.

source: You entered a 0 as the denominator. This means division by zero, which is not allowed. This question will be counted as not correctly solved.
ar: لقد أدخلت 0 كمقام. وهذا يعني القسمة على الصفر، وهو أمر غير مسموح به. سيحسب هذا السؤال على أنه لم يحل بشكل صحيح.
eo: Vi enigis 0 kiel la denominatoro. Ĉi tio signifas dividon per nulo, kio ne estas permesita. Ĉi tiu demando estos kalkulita kiel ne ĝuste solvita.
nl: Je hebt 0 opgegeven voor de noemer. Dit betekent delen door 0, en dat kan niet. Dit antwoord wordt niet goed gerekend.

source: You entered the correct result, but not reduced. Always enter your results as reduced. This question will be counted as not correctly solved.
ar: لقد أدخلت النتيجة الصحيحة، ولكن لم تصغر. أدخل نتائجك دائمًا على أنها مصغرة. سيحسب هذا السؤال على أنه لم يحل بشكل صحيح.
eo: Vi enigis la ĝustan rezulton, sed ne reduktitan. Ĉiam enigu viajn rezultojn kiel reduktitajn. Ĉi tiu demando estos kalkulita kiel ne ĝuste solvita.
nl: Je hebt het juiste antwoord gegeven, maar helaas niet vereenvoudigd. Geef altijd vereenvoudigde antwoorden. Dit antwoord wordt niet goed gerekend.

source: N&ext
ar: ال&تّالي
eo: S&ekva
nl: Volg&ende

# @info:tooltip
source: Add prime factor 2.
ar: أضف عامل أولي 2.
eo: Aldonu priman faktoron 2.

# @info:tooltip
source: Add prime factor 3.
ar: أضف عامل أولي 3.
eo: Aldonu priman faktoron 3.

# @info:tooltip
source: Add prime factor 5.
ar: أضف عامل أولي 5.
eo: Aldonu priman faktoron 5.

# @info:tooltip
source: Add prime factor 7.
ar: أضف عامل أولي 7.
eo: Aldonu priman faktoron 7.

# @info:tooltip
source: Add prime factor 11.
ar: أضف عامل أولي 11.
eo: Aldonu priman faktoron 11.

# @info:tooltip
source: Add prime factor 13.
ar: أضف عامل أولي 13.
eo: Aldonu priman faktoron 13.

# @info:tooltip
source: Add prime factor 17.
ar: أضف عامل أولي 17.
eo: Aldonu priman faktoron 17.

# @info:tooltip
source: Add prime factor 19.
ar: أضف عامل أولي 19.
eo: Aldonu priman faktoron 19.

# @info:tooltip
source: Removes the last entered prime factor.
ar: أزل آخر عامل أولي مدخل.
eo: Forigas la laste enigitan priman faktoron.

# @info:tooltip
source: In this exercise you have to factorize a given number.
ar: في هذا التمرين عليك تحليل رقم معين.
eo: En ĉi tiu ekzerco vi devas faktorigi donitan nombron.

source: In this exercise you have to factorize a given number. You have to enter all prime factors of the number. You can add a prime factor by clicking on the corresponding button. The chosen prime factors will be shown in the input field. Do not forget to enter all prime factors, even when a prime factor repeats several times. Click the 'Backspace' button to remove the last entered prime factor.
ar: في هذا التمرين، عليك تحليل عدد معين إلى عوامل. عليك إدخال جميع العوامل الأولية للعدد. يمكنك إضافة عامل أولي بالنقر فوق الزر المقابل. ستظهر العوامل الأولية المختارة في حقل الإدخال. لا تنس إدخال جميع العوامل الأولية، حتى عندما يتكرر عامل أولي عدة مرات. انقر فوق مفتاح "Backspace" لإزالة آخر عامل أولي تم إدخاله.
eo: En ĉi tiu ekzerco vi devas faktorigi donitan nombron. Vi devas enigi ĉiujn primajn faktorojn de la nombro. Vi povas aldoni priman faktoron alklakante la respondan butonon. La elektitaj primaj faktoroj estos montritaj en la eniga kampo. Ne forgesu enigi ĉiujn primajn faktorojn, eĉ kiam prima faktoro ripetas plurajn fojojn. Alklaku la butonon 'Retropaŝo' por forigi la laste enigitan priman faktoron.
nl: In deze oefening moet je een gegeven getal in factoren ontbinden. Je moet alle priemfactoren van het getal invullen. Je kunt een priemfactor toevoegen door op de knop ervan te klikken. De gekozen priemfactoren zie je dan in het invoervakje. Vergeet niet alle priemfactoren in te vullen, ook al moet dat meer dan een keer. Met de terugtoets kun je de laatst ingevulde priemfactor wissen.

# @info:tooltip
source: Enter the integer part of the fraction
ar: أدخل الجزء الصحيح من الكسر
eo: Enigu la entjeran parton de la frakcio

# @info:tooltip
source: Enter the numerator of the fraction
ar: أدخل بسط الكسر
eo: Enigu la numeranton de la frakcio

# @info:tooltip
source: Enter the denominator of the fraction
ar: أدخل مقام الكسر
eo: Enigu la nomanton de la frakcio

# @info:tooltip
source: In this exercise you have to convert a mixed number into a ratio and vice versa.
ar: في هذا التمرين عليك تحويل رقم مختلط إلى نسبة والعكس صحيح.
eo: En ĉi tiu ekzerco vi devas konverti miksitan nombron al proporcio kaj inverse.

source: In this exercise you have to convert a mixed number into a ratio and vice versa. Do not forget to reduce the result.
ar: في هذا التمرين عليك تحويل رقم مختلط إلى نسبة والعكس صحيح. لا تنس تصغر النتيجة.
eo: En ĉi tiu ekzerco vi devas konverti miksitan nombron al proporcio kaj inverse. Ne forgesu redukti la rezulton.
nl: In deze oefening moet je een gemengd getal omrekenen naar een verhouding, en terug. Vergeet niet het antwoord te vereenvoudigen.

# @info:tooltip
source: Click this button to check your result. The button will not work if you have not entered a result yet.
ar: انقر هذا الزر للتحقق من نتيجتك. لن يعمل الزر إذا لم تدخل النتيجة بعد.
eo: Alklaku ĉi tiun butonon por kontroli vian rezulton. La butono ne funkcios se vi ankoraŭ ne enigis rezulton.

# @info:tooltip
source: Click this button to get the next question.
ar: انقر فوق هذا الزر للحصول على السؤال التالي.
eo: Alklaku ĉi tiun butonon por ricevi la sekvan demandon.

source: You entered 0 as the denominator. This means division by zero, which is not allowed. This question will be counted as not correctly solved.
ar: لقد أدخلت 0 كمقام. وهذا يعني القسمة على الصفر، وهو أمر غير مسموح به. سيحسب هذا السؤال على أنه لم يحل بشكل صحيح.
eo: Vi enigis 0 kiel la denominatoro. Ĉi tio signifas dividon per nulo, kio ne estas permesita. Ĉi tiu demando estos kalkulita kiel ne ĝuste solvita.
nl: Je hebt 0 opgegeven voor de noemer. Dit betekent delen door 0, en dat kan niet. Dit antwoord wordt niet goed gerekend.

source: You entered the correct result, but not in the mixed number notation. This question will be counted as not correctly solved.
ar: لقد أدخلت النتيجة الصحيحة، ولكن ليس في صيغة الأرقام المختلطة. سيحتسب هذا السؤال على أنه لم يحل بشكل صحيح.
eo: Vi enigis la ĝustan rezulton, sed ne en la miksita nombronotacio. Ĉi tiu demando estos kalkulita kiel ne ĝuste solvita.
nl: Je hebt het juiste antwoord gegeven, maar helaas niet als een gemengde getal.Dit antwoord wordt jammer genoeg als niet goed gerekend geteld.

source: You entered the correct result, but not reduced. This question will be counted as not correctly solved.
ar: لقد أدخلت النتيجة الصحيحة، ولكن لم يتم تصغيرها. سيحتسب هذا السؤال على أنه لم يحل بشكل صحيح.
eo: Vi enigis la ĝustan rezulton, sed ne reduktita. Ĉi tiu demando estos kalkulita kiel ne ĝuste solvita.
nl: Je hebt het juiste antwoord gegeven, maar helaas niet vereenvoudigd.Dit antwoord wordt jammer genoeg als niet goed gerekend geteld.

# %1 percentage of %2
source: %1% of %2 =
ar: %1% من %2 =
eo: %1% el %2 =
nl: %1% van %2 =

# @info:tooltip
source: Enter the result of percentage question
ar: أدخل نتيجة سؤال النسبة المئوية
eo: Enigu la rezulton de procenta demando

# @info:tooltip
source: In this exercise you have to work with percentage questions.
ar: في هذا التمرين عليك التعامل مع أسئلة النسبة المئوية.
eo: En ĉi tiu ekzerco vi devas labori kun procentaj demandoj.

source: In this exercise you have to enter the fraction of the given number.
ar: في هذا التمرين عليك إدخال الكسر من الرقم المحدد.
eo: En ĉi tiu ekzerco vi devas enigi la frakcion de la donita nombro.
nl: In deze oefening moet je het breukdeel geven van het gegeven getal.

source: Expand
ar: وسع
eo: Vastigi
nl: Gelijknamig maken

source: New
ar: جديد
eo: Nova
nl: Nieuw

# @action opens a new question
source: &New
ar: &جديد
eo: &Nova
nl: &Nieuw

# @action go to the main screen
source: Back
ar: عُد
eo: Reen
nl: Terug

# @action opens hint
source: Hint
ar: تلميح
eo: Sugesto

source: Colors
ar: الألوان
eo: Koloroj
nl: Kleuren

source: Now the parts of the inside ring and outside ring have the same size, and we can add the fractions! This is called finding the main denominator. The main denominator divides the rings into equal parts.
ar: الآن أصبحت أجزاء الحلقة الداخلية والحلقة الخارجية متساوية الحجم، ويمكننا جمع الكسور! هذا ما يسمى بإيجاد المقام الرئيس. يقسم المقام الرئيس الحلقات إلى أجزاء متساوية.
eo: Nun la partoj de la interna ringo kaj ekstera ringo havas la saman grandecon, kaj ni povas aldoni la frakciojn! Tion oni nomas trovi la ĉefan denominatoron. La ĉefa denominatoro dividas la ringojn en egalajn partojn.
nl: De delen in de binnen- en de buitenring zijn nu even groot, en we kunnen de breuken optellen! Dit wordt het vinden van de grootste gemene deler genoemd. Deze verdeelt de ringen in delen die even groot zijn.

source: There is a smaller main denominator. Can you find it?
ar: هناك قاسم رئيسي أصغر. هل يمكنك العثور عليه؟
eo: Estas pli malgranda ĉefa denominatoro. Ĉu vi povas trovi ĝin?
nl: Er is een kleinere gemeenschappelijke deler. Kan je die vinden?

source: You have just expanded the first fraction by %1. Our main goal is to make all parts be the same size. Try expanding the first fraction by %2 and the second fraction by %3.
ar: قد وسعت الكسر الأول بنسبة %1. هدفنا الرئيسي هو جعل جميع الأجزاء بنفس الحجم. حاول توسيع الكسر الأول بنسبة %2 والكسر الثاني بنسبة %3.
eo: Vi ĵus vastigis la unuan frakcion je %1. Nia ĉefa celo estas ke ĉiuj partoj estu samgrandaj. Provu vastigi la unuan frakcion je %2 kaj la duan frakcion je %3.
nl: Je hebt zojuist de eerste breuk met %1 vermenigvuldigd. We willen eigenlijk alle delen gelijknamig maken. Probeer de eerste breuk met %2 te vermenigvuldigen, en de tweede breuk met %3.

source: You have just expanded the second fraction by %1. Our main goal is to make all parts be the same size. Try expanding the first fraction by %2 and the second fraction by %3.
ar: قد وسعت الكسر الثاني بنسبة %1. هدفنا الرئيسي هو جعل جميع الأجزاء بنفس الحجم. حاول توسيع الكسر الأول بنسبة %2 والكسر الثاني بنسبة %3.
eo: Vi ĵus vastigis la duan frakcion je %1. Nia ĉefa celo estas ke ĉiuj partoj estu samgrandaj. Provu vastigi la unuan frakcion je %2 kaj la duan frakcion je %3.
nl: Je hebt zojuist de tweede breuk met %1 vermenigvuldigd. We willen eigenlijk alle delen gelijknamig maken. Probeer de eerste breuk met %2 te vermenigvuldigen, en de tweede breuk met %3.

# Inserted as %1 in the message below.
source: %2 of 1 painted part.
ar: %2 من لا شيء.
eo: %2 el 1 pentrita parto.
nl: %2 van 1 gekleurd deel.

# Inserted as %2 in the message below.
source: %2 of 1 painted part.
ar: %2 من لا شيء.
eo: %2 el 1 pentrita parto.
nl: %2 van %1 gekleurde delen.

# %1 and %2 are the two messages translated above.
source: The outside ring represents the left fraction. %1 The inside ring represents the right fraction. %2 The 'Expand' spinboxes expand each fraction. Try to change one of the spinbox values!
ar: تمثل الحلقة الخارجية الكسر الأيسر. %1 تمثل الحلقة الداخلية الكسر الأيمن. %2 تعمل مربعات الدوران "توسيع" على توسيع كل كسر. حاول تغيير إحدى قيم مربع الدوران!
eo: La ekstera ringo reprezentas la maldekstran frakcion. %1 La interna ringo reprezentas la ĝustan frakcion. %2 La spinkestoj 'Pligrandigi' vastigas ĉiun frakcion. Provu ŝanĝi unu el la valoroj de spinkesto!
nl: De buitenste ring geeft de linkse breuk weer. %1 De binnenste ring geeft de rechtse breuk weer. %2 Met de draaischakelaar 'Vermenigvuldigen' worden beide breuken vermenigvuldigd. Probeer een van de waarden erin te veranderen!

source: KBruch
ar: الكسور

source: Learn calculating with fractions
ar: تعلم الحساب بالكسور
eo: Lerni kalkuli kun frakcioj
nl: Met breuken leren rekenen

source: © 2002-2011, Sebastian Stein
ar: © 2002-2011، سيباستيان شتاين

source: Sebastian Stein
ar: سيباستيان شتاين

source: Current maintainer, original author
ar: الصائن الحالي، المؤلف الأصلي
eo: Nuna prizorganto, origina aŭtoro
nl: Huidige onderhoud, originele auteur

source: Paulo Cattai
ar: باولو كاتاي

source: New interface design and usability improvements
ar: واجهة مستخدِم جديدة وتحسينات لسهولة الاستخدام
eo: Nova interfaco-dezajno kaj uzeblo-plibonigoj
nl: Nieuw ontwerp van de interface en verbeterde gebruiksmogelijkheden

source: Danilo Balzaque
ar: دانيلو بلزاك

source: Roberto Cunha
ar: روبرتو ريبيرو فيلهو

source: Tadeu Araujo
ar: تادو اراوجو

source: Tiago Porangaba
ar: تياغو بورانغابا

source: Active exercise.
ar: التمرين النشط.
eo: Aktiva ekzerco.
nl: Huidige oefening.

source: Saves the active exercise's type.
ar: يحفظ نوع التمرين النشط.
eo: Konservas la tipon de la aktiva ekzerco.
nl: Slaat het type op van de huidige oefening.

source: Enable Addition
ar: مكّن الإضافة
eo: Ebligi Aldonon
nl: Optellen toestaan

source: Enable Addition for task generation.
ar: مكّن الإضافة عند توليد المهام.
eo: Ebligi Aldonon por taskogenerado.
nl: Opgaven verzinnen met optellen.

source: Enable Subtraction
ar: مكّن الطرح
eo: Ebligi Subtraho
nl: Aftrekken toestaan

source: Enable Addition/Subtraction for task generation.
ar: مكّن الجمع/الطرح عند توليد المهام.
eo: Ebligi Adicion/Subtrahon por taska generado
nl: Opgaven verzinnen met optellen en aftrekken.

source: Enable Division
ar: مكّن القسمة
eo: Ebligi Dividadon
nl: Delen toestaan

source: Enable Division for task generation.
ar: مكّن القسمة عند توليد المهام.
eo: Ebligi Dividadon por taskogenerado.
nl: Opgaven verzinnen met delen.

source: Enable Multiplication
ar: مكّن الضرب
eo: Ebligi Multiplikon
nl: Vermenigvuldigen toestaan

source: Enable Multiplication for task generation.
ar: مكّن الضرب عند توليد المهام.
eo: Ebligi Multiplikadon por taskogenerado.
nl: Opgaven verzinnen met vermenigvuldigen.

source: Enable Multiplication/Division
ar: مكّن الضرب/القسمة
eo: Ebligi Multiplikon/Dividadon
nl: Vermenigvuldigen/delen toestaan

source: Enable Multiplication/Division for task generation.
ar: مكّن الضرب/القسمة عند توليد المهام.
eo: Ebligi Multiplikon/Dividadon por taskogenerado.
nl: Opgave verzinnen met vermenigvuldigen en delen.

source: Number of fractions
ar: عدد الكسور
eo: Nombro de frakcioj
nl: Aantal breuken

source: Set the number of fractions for task generation.
ar: عيّن عدد الكسور عند توليد المهام.
eo: Agordu la nombron da frakcioj por taskogenerado.
nl: Stel het aantal breuken in een opgave in.

source: Max. main denominator
ar: أكبر مقام رئيس
eo: Maks. ĉefa denominatoro
nl: Grootste gemene deler

source: Set the maximum value of the main denominator.
ar: عيّن القيمة القصوى للمقام الرئيس.
eo: Agordu la maksimuman valoron de la ĉefa denominatoro.
nl: Stel de grootste waarde in voor de grootste gemene deler.

source: Answer reduced fractions
ar: الإجابة على الكسور المخفضة
eo: Respondi reduktitajn frakciojn
nl: Antwoord vereenvoudigen

source: Set if the fractions need to be reduced.
ar: حدد ما إذا كانت الكسور بحاجة إلى تصغيرها.
eo: Agordu se la frakcioj devas esti reduktitaj.
nl: Stel in dat de breuken moeten worden vereenvoudigd.

source: Mixed number
ar: عدد مختلط
eo: Miksita nombro
nl: Gemengd getal

source: Set if the fractions will appear in mixed form or not on solution.
ar: حدد ما إذا كانت الكسور ستظهر في شكل مختلط أم لا في الحل.
eo: Agordu ĉu la frakcioj aperos en miksita formo aŭ ne en solvo.
nl: Stel in of de oplossingen moeten worden gegeven als gemengde getallen.

source: Set if the fractions will need answers in mixed form or not on solution.
ar: حدد ما إذا كانت الكسور ستحتاج إلى إجابات في شكل مختلط أم لا في الحل.
eo: Fiksu ĉu la frakcioj bezonos respondojn en miksita formo aŭ ne en solvo.
nl: Stel in of de antwoorden moeten worden gegeven als gemengde getallen.

source: Set if the fractions will appear in mixed form or not in questions.
ar: حدد ما إذا كانت الكسور ستظهر بشكل مختلط أم لا في الأسئلة.
eo: Agordu ĉu la frakcioj aperos en miksita formo aŭ ne en demandoj.
nl: Stel in of de vragen moeten worden gegeven met gemengde getallen.

source: Number of correctly solved tasks
ar: عدد المهام المحلولة بشكل صحيح
eo: Nombro de ĝuste solvitaj taskoj
nl: Aantal goed opgeloste opgaven

source: Number of solved tasks
ar: عدد المهام المحلولة
eo: Nombro de solvitaj taskoj
nl: Aantal gemaakte opgaven

source: Total number of solved tasks
ar: إجمالي عدد المهام المحلولة
eo: Tuta nombro da solvitaj taskoj
nl: Totaal aantal gemaakte opgaven

source: Number of skipped tasks
ar: عدد المهام المتخطاة
eo: Nombro de preterpasitaj taskoj
nl: Aantal opgaven die zijn overgeslagen

source: Color of the numbers in the task view
ar: لون الأرقام في عرض المهمة
eo: Koloro de la nombroj en la taskovido
nl: Kleur van de getallen in de opdracht

source: Color of the operation signs in the task view
ar: لون علامات العملية في عرض المهمة
eo: Koloro de la operacio signas en la taskovido
nl: Kleur van de bewerkingstekens in de opdracht

source: Color of the fraction bars in the task view
ar: لون أشرطة الكسر في عرض المهمة
eo: Koloro de la frakciaj strioj en la taskovido
nl: Kleur van de breukstreepjes in de opdracht

source: Font used for the task view
ar: الخط المستخدم لعرض المهمة
eo: Tiparo uzata por la taskovido
nl: Lettertype gebruikt in de opdracht

source: Enable showing the result also as a mixed number
ar: تمكين إظهار النتيجة أيضًا كرقم مختلط
eo: Ebligi montri la rezulton ankaŭ kiel miksitan nombron
nl: Antwoord tonen met de gehelen eruit gehaald aanzetten (gemengde getallen)

source: Enables/disables showing the result also in the special mixed-number notation.
ar: تمكين/تعطيل إظهار النتيجة أيضًا في تدوين الأرقام المختلطة الخاص.
eo: Ebligas/malŝaltas montri la rezulton ankaŭ en la speciala miksnumera notacio.
nl: Aan-/uitzetten van het tonen van het antwoord als een gemengd getal.

source: Question:
ar: السؤال:
eo: Demando:
nl: Vraag:

source: Answer:
ar: الجواب:
eo: Respondo:
nl: Antwoord:

source: Operations:
ar: العمليات:
eo: Operacioj:
nl: Bewerkingen:

source: Arithmetic
ar: الحسابيات
eo: Aritmetiko
nl: Rekenen

source: Options:
ar: الخيارات:
eo: Opcioj:
nl: Opties:

# @info:tooltip
source: Set the options to solve the exercises.
ar: ضبط الخيارات لحل التمارين.
eo: Metu la elekteblojn por solvi la ekzercojn.

source: This part of the window shows the options to solve the exercises. Use the handle between the options and main window to change the size of this window part or to hide it by moving the handle to the left border of the main window.
ar: يعرض هذا الجزء من النافذة خيارات حل التمارين. استخدم المقبض الموجود بين الخيارات والنافذة الرئيسة لتغيير حجم هذا الجزء من النافذة أو لإخفائه عن طريق تحريك المقبض إلى الحد الأيسر للنافذة الرئيسة.
eo: Ĉi tiu parto de la fenestro montras la eblojn por solvi la ekzercojn. Uzu la tenilon inter la opcioj kaj ĉefa fenestro por ŝanĝi la grandecon de ĉi tiu fenestra parto aŭ por kaŝi ĝin movante la tenilon al la maldekstra bordo de la ĉefa fenestro.
nl: In dit deel van het venster zie je de opties voor het maken van de oefeningen. Met het handvat tussen de opties en het hoofdvenster kan de grootte van dit vensterdeel worden veranderd, of dit vensterdeel worden verborgen door dit handvat naar de linkerrand van het hoofdvenster te slepen.

source: Mixed number:
ar: عدد مختلط:
eo: Miksita nombro:
nl: Gemengde getal:

# @info:tooltip
source: Set if the fractions will appear as mixed numbers or not in the question expression (mixed number example: 1 4/5 = 9/5 ).
ar: حدد ما إذا كانت الكسور ستظهر كأرقام مختلطة أم لا في تعبير السؤال (مثال رقم مختلط: 1 4/5 = 9/5).
eo: Agordu ĉu la frakcioj aperos kiel miksitaj nombroj aŭ ne en la demanda esprimo (ekzemplo pri miksita nombro: 1 4/5 = 9/5 ).

# @info:tooltip
source: Set if the fractions will appear as mixed numbers or not in the answer (mixed number example: 1 4/5 = 9/5 ).
ar: حدد ما إذا كانت الكسور ستظهر كأرقام مختلطة أم لا في الإجابة (مثال رقم مختلط: 1 4/5 = 9/5).
eo: Agordu ĉu la frakcioj aperos kiel miksitaj nombroj aŭ ne en la respondo (miksita nombro-ekzemplo: 1 4/5 = 9/5 ).

source: Addition:
ar: الجمع:
eo: Aldono:
nl: Optellen:

# @info:tooltip
source: Check this to use addition operator.
ar: أشّر على هذا لاستخدام عامل الإضافة.
eo: Marku ĉi tion por uzi aldonan operatoron.
