Repository: KDE/kbruch
Catalog: po/*/kbruch.po
Languages: ar, eo, nl

source: Subtraction:
ar: الطرح:
eo: Subtraho:
nl: Aftrekken:

# @info:tooltip
source: Check this to use subtraction operator.
ar: أشّر على هذا لاستخدام عامل الطرح.
eo: Marku ĉi tion por uzi operatoron de subtraho.

source: Multiplication:
ar: الضرب:
eo: Multipliko:
nl: Vermenigvuldigen:

# @info:tooltip
source: Check this to use multiplication operator.
ar: أشّر على هذا لاستخدام عامل الضرب.
eo: Marku ĉi tion por uzi multiplikan operatoron.

source: Division:
ar: القسمة:
eo: Divido:
nl: Delen:

# @info:tooltip
source: Check this to use division operator.
ar: أشّر على هذا لاستخدام عامل القسمة.
eo: Marku ĉi tion por uzi dividan operatoron.

source: Reduced form:
ar: نموذج مخفض:
eo: Reduktita formo:
nl: Vereenvoudigd:

# @info:tooltip
source: Check this to force the use of the reduced form.
ar: أشّر على هذا لفرض استخدام النموذج المصغر.
eo: Marku ĉi tion por devigi la uzon de la reduktita formo.

source: Number of terms:
ar: عدد الحدود:
eo: Nombro da terminoj:
nl: Aantal termen:

# @info:tooltip
source: The number of terms you want
ar: عدد الحدود التي تريدها
eo: La nombro de termoj kiujn vi volas

source: Choose the number of terms (2, 3, 4 or 5) you want for calculating fractions.
ar: اختر عدد الحدود (2، 3، 4 أو 5) التي تريدها لحساب الكسور.
eo: Elektu la nombron da terminoj (2, 3, 4 aŭ 5) kiujn vi volas por kalkuli frakciojn.
nl: Kies het gewenste aantal termen (2, 3, 4 of 5) voor de berekeningen met breuken.

source: Maximum denominator:
ar: المقام الأقصى:
eo: Maksimuma denominatoro:
nl: Grootste noemer:

# @info:tooltip
source: The maximum number you can have as main denominator
ar: الحد الأقصى للعدد الذي يمكنك الحصول عليه كقاسم رئيس
eo: La maksimuma nombro, kiun vi povas havi kiel ĉefa nomanto

source: Choose the number which will be the maximum for the main denominator: 10, 20, 30, 40 or 50.
ar: اختر الرقم الذي سيكون الحد الأقصى للمقام الرئيس: 10 أو 20 أو 30 أو 40 أو 50.
eo: Elektu la nombron, kiu estos la maksimumo por la ĉefa nomanto: 10, 20, 30, 40 aŭ 50.
nl: Kies de grootste waarde voor de grootste gemene deler: 10, 20, 30, 40 of 50.

# @info:tooltip
source: Reset statistics and set a new task.
ar: صفّر الإحصائيات وعيّن مهمة جديدة.
eo: Restarigi statistikojn kaj starigi novan taskon.

source: Back
ar: عُد
eo: Reen
nl: Terug

# @info:tooltip
source: Go back to Modes screen.
ar: الرجوع إلى شاشة الأوضاع.
eo: Reiru al la ekrano de Reĝimoj.

source: Arithmetic
ar: الحساب
eo: Aritmetiko
nl: Rekenen

# @info:tooltip
source: In this exercise you have to solve a given question with fractions.
ar: في هذا التمرين عليك حل سؤال معين بالكسور.
eo: En ĉi tiu ekzerco vi devas solvi donitan demandon kun frakcioj.

source: Comparison
ar: المقارنة
eo: Komparo
nl: Vergelijken

source: Conversion
ar: التحويل
eo: Konvertiĝo
nl: Omrekenen

source: Mixed Numbers
ar: أرقام مختلطة
eo: Miksitaj Nombroj
nl: Gemengde getallen

source: Factorization
ar: التحليل للعوامل
eo: Faktorigo
nl: Ontbinden in factoren

source: Percentage
ar: النسبة المئوية
eo: Procento
nl: Percentages

# @action opens a new question
source: New
ar: جديد
eo: Nova
nl: Nieuwe vraag

# @action go to the main screen
source: &Back
ar: &عُد
eo: &Reen
nl: &Terug

# Arithmetic Exercise
source: Arithmetic
ar: الحسابيات
eo: Aritmetiko
nl: Rekenen

# Comparison Exercise
source: Comparison
ar: المقارنة
eo: Komparo
nl: Vergelijken

# Conversion Exercise
source: Conversion
ar: تحويل
eo: Konvertiĝo
nl: Omrekenen

# Mixed Numbers Exercise
source: MixedNumbers
ar: أرقام مختلطة
eo: Miksitaj Nombroj
nl: GemengdeGetallen

# Factorization Exercise
source: Factorization
ar: تحليل إلى عوامل
eo: Faktorigo
nl: Ontbinden in factoren

# Percentage Exercise
source: Percentage
ar: النسبة
eo: Procento

source: Fonts
ar: الخطوط
eo: Tiparoj
nl: Lettertypen

source: Percentage
ar: النسبة
eo: Elcentaĵo

source: Comparison
ar: المقارنة
eo: Komparo
nl: Vergelijken

source: Conversion
ar: تحويل
eo: Konvertiĝo
nl: Omrekenen

source: Mixed Numbers
ar: أرقام مخطلتة
eo: Miksitaj Nombroj
nl: Gemengde getallen

source: Factorization
ar: تحليل إلى عوامل
eo: Faktorigo
nl: Ontbinden in factoren

source: Solution:
ar: الحل:
eo: Solvo:
nl: Oplossing:

source: Correct!
ar: صحيح!
eo: Ĝuste!
nl: Goed!

source: Incorrect!
ar: خطأ!
eo: Malkorekta!
nl: Fout!

source: This is the current total number of solved tasks.
ar: هذا هو العدد الكلي الحالي من المهام المحلولة.
eo: Ĉi tio estas la nuna totala nombro de solvitaj taskoj.
nl: Dit is tot nu toe het aantal gemaakte opgaven.

source: Questions:
ar: الأسئلة:
eo: Demandoj:
nl: Vragen:

# @info:status the number of correct answers
source: Correct:
ar: الصح:
eo: Ĝuste:
nl: Goed:

# @info:status the number of incorrect answers
source: Incorrect:
ar: الخطأ:
eo: Malkorekta:
nl: Fout:

# @info:status the number of skipped answers
source: Skipped:
ar: التخطي:
eo: Preterpasita:
nl: Overgeslagen:

source: This is the current total number of correctly solved tasks.
ar: هذا العدد الكلي الحالي من المهام المحلولة الصحيحة.
eo: Ĉi tio estas la nuna totala nombro de ĝuste solvitaj taskoj.
nl: Je hebt tot nu toe dit aantal opgaven goed gemaakt.

source: This is the current total number of unsolved tasks.
ar: هذا العدد الكلي الحالي من المهام غير المحلولة.
eo: Ĉi tio estas la nuna totala nombro de nesolvitaj taskoj.
nl: Je hebt tot nu toe dit aantal opgaven niet goed gedaan.

source: This is the current total number of skipped tasks.
ar: هذا هو العدد الإجمالي الحالي للمهام المتخطاة.
eo: Ĉi tio estas la nuna totala nombro de preterlasitaj taskoj.
nl: Dit is tot nu toe het aantal opgaven dat je hebt overgeslagen.

# @info:tooltip
source: This part of the window shows the statistics.
ar: هذا الجزء من النافذة يعرض الإحصائيات.
eo: Ĉi tiu parto de la fenestro montras la statistikon.

source: This part of the window shows the statistics. Each exercise you do is counted. You can reset the statistics by clicking on the 'New' button in the toolbar or by selecting 'New' from the 'File' menu
ar: يعرض هذا الجزء من النافذة الإحصائيات. كل تمرين تقوم به يُحسب. يمكنك تصفير الإحصائيات بالنقر على زر ”جديد“ في شريط الأدوات أو عن طريق تحديد ”جديد“ من قائمة ”ملف“
eo: Ĉi tiu parto de la fenestro montras la statistikojn. Ĉiu ekzerco, kiun vi faras, estas kalkulita. Vi povas restarigi la statistikon alklakante la butonon 'Nova' en la ilobreto aŭ elektante 'Nova' el la menuo 'Dosiero'
nl: In dit deel van het venster zie je hoe goed je het hebt gedaan. Elke oefening die je doet wordt geteld. Als je begint klik je op de knop 'Nieuw' in de werkbalk, of selecteer je 'Nieuw' in het menu 'Bestand'

source: &Reset
ar: &صفّر
eo: &Restarigi
nl: &Terugzetten

# @info:tooltip
source: Click this button to reset the statistics.
ar: انقر فوق هذا الزر لتصفير الإحصائيات.
eo: Alklaku ĉi tiun butonon por restarigi la statistikon.

source: &Number:
ar: &عدد:
eo: &Nombro:
nl: &Getal:

source: Change the color of the numbers
ar: غيّر لون الارقام
eo: Ŝanĝu la koloron de la nombroj
nl: Verander de kleur van de getallen

source: &Operation sign:
ar: &علامة العملية:
eo: &Operacia signo:
nl: &Bewerkingsteken:

source: Change the color of the operation signs
ar: تغيير لون علامات التشغيل
eo: Ŝanĝu la koloron de la operacia signo
nl: Verander de kleur van de bewerkingstekens

source: &Fraction bar:
ar: &شريط الكسر:
eo: &Frakcia stango:
nl: B&reukstreep:

source: Change the color of the fraction bar
ar: غيِّر لون شريط الكسر
eo: Ŝanĝu la koloron de la dividaĵa streko
nl: Verander de kleur van de breukstreep

source: Change the font of the numbers
ar: غيّر خط الارقام
eo: Ŝanĝu la tiparon de la nombroj
nl: Verander het lettertype voor de getallen

# @info:tooltip
source: Click this button to skip this question.
ar: انقر على هذا الزر لتخطي هذا السؤال
eo: Alklaku ĉi tiun butonon por preterlasi ĉi tiun demandon.

source: In this exercise you have to solve the generated question. You have to enter the integer part of the fraction and the numerator and the denominator. You can adjust the difficulty of the question in the options window part. Do not forget to reduce the result, if the use of the reduced form is forced.
ar: في هذا التمرين عليك حل السؤال المطروح. عليك إدخال الجزء الصحيح من الكسر والبسط والمقام. يمكنك يمكنك ضبط صعوبة السؤال في جزء نافذة الخيارات. لا تنسَ تصغير النتيجة، إذا كان استخدام الصيغة المصغرة إجباريًا.
eo: En ĉi tiu ekzerco vi devas solvi la generitan demandon. Vi devas enigi la entjeran parton de la frakcio kaj la numeratoro kaj la denominatoro. Vi povas ĝustigi la malfacilecon de la demando en la opcia fenestroparto. Ne forgesu redukti la rezulton, se la uzo de la reduktita formo estas devigita.
nl: In deze oefening moet je een opgave maken die de computer heeft bedacht. Je moet het hele deel van de breuk invullen, en de teller en de noemer. Je kunt in het vensterdeel voor de opties. instellen hoe moeilijk de opgaven mogen zijn. Vergeet niet het antwoord te vereenvoudigen, als is ingesteld dat dit moet.

source: Backspace
eo: Retropaŝo
nl: Terugtoets
